In [2]:
import pandas as pd

In [3]:
# 데이터 프레임 생성
date_list = [{'date': '2000-06-27'},
         {'date': '2002-09-24'},
         {'date': '2005-12-20'}]
df = pd.DataFrame(date_list, columns = ['date'])
df

         date
0  2000-06-27
1  2002-09-24
2  2005-12-20

In [4]:
# 열 기준 데이터 업데이트
def extract_year(date):
    return date.split('-')[0]
df['year'] = df['date'].map(extract_year)
df

         date  year
0  2000-06-27  2000
1  2002-09-24  2002
2  2005-12-20  2005

In [5]:
# 데이터 프레임 생성
job_list = [{'age': 20, 'job': 'student'},
         {'age': 30, 'job': 'developer'},
         {'age': 30, 'job': 'teacher'}]
df = pd.DataFrame(job_list)
df

   age        job
0   20    student
1   30  developer
2   30    teacher

In [6]:
# 열 기준 데이터 업데이트
df.job = df.job.map({'student':1, "developer":2, "teacher":3})
df

   age  job
0   20    1
1   30    2
2   30    3

In [7]:
# 데이터 프레임 생성
x_y = [{'x': 5.5, 'y': -5.6},
         {'x': -5.2, 'y': 5.5},
         {'x': -1.6, 'y': -4.5}]
df = pd.DataFrame(x_y)
df

     x    y
0  5.5 -5.6
1 -5.2  5.5
2 -1.6 -4.5

In [8]:
import numpy as np

In [10]:
# 모든 데이터에 대해 업데이트
df = df.applymap(np.around) # 반올림
df

     x    y
0  6.0 -6.0
1 -5.0  6.0
2 -2.0 -4.0